_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_BIM_СоответствиеОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_BIM_СоответствиеОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шифр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНормативногоСборника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторВМодели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательДляРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШифрРодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНормативногоСборникаРодителя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_СтатусыСметныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_СтатусыСметныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактированиеЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыНормативныхСборников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыНормативныхСборников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтроительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПусконаладочныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемонтноСтроительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеставрационноВосстановительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническоеОбслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СметныеЦеныНаМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СметныеЦеныНаЭксплуатациюМашин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогШтучныхКонструкций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прейскурант0608НаСборныйЖелезобетон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрейскурантыНаРемонтТехнологическогоОборудования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрейскурантОптовыхЦенНаМатериалыИОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦеныНаМестныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УкрупненныеСметныеНормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеЗатратыВЗимнееВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СодержаниеОбъектовГородскойСреды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременныеЗданияИСооружения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Калькуляция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_Конструктив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_Конструктив</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СМ_ОбъектыСтроительства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонструктива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_BIM_ТипыКонструктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ОбъектыСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_ОбъектыСтроительства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОбъектаСтроительства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураГенподрядчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМесячныеПланы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНедельноСуточныеПланы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураРаботЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиЗаполнятьПлановыйРасходМатериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьФактРаботыВодителейТехникиПутевымиЛистами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовМатериалы</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовИсполнители</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовМеханизмы</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумераторСмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_НумераторыСмет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПроектMSP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумераторОбъектныхСмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_НумераторыСмет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_214ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ВестиРаспределениеМатериаловПоРаботам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумераторСводныхСмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_НумераторыСмет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_НоменклатураДляЗаказаПереработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ОбъектСтроительстваERP</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ИндекснаяСтраницаWebKit</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиСтроительства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_РолиУчастниковСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/СМ_BIM_ВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция из вложного имени элемента модели выделяет простое для справочника
//
// Параметры:
//     ИмяКонструктиваИсх - Строка - имя, переданное из BIM системы.
//
// Возвращаемое значение:
//     Строка - короткое имя.
//
Функция ПреобразоватьИмяКонструктива(Знач ИмяКонструктиваИсх) Экспорт
	
	ИмяКонструктива = ВРег(ИмяКонструктиваИсх);
	Если СтрНайти(ИмяКонструктива, "СТЕНА")>0 Тогда
		Возврат "Стены"; 
	КонецЕсли;
	Если СтрНайти(ИмяКонструктива, "КОЛОННА")>0 Тогда
		Возврат "Колонны"; 
	КонецЕсли;
	Если СтрНайти(ИмяКонструктива, "ПЕРЕКРЫТИЕ")>0 Тогда
		Возврат "Перекрытия"; 
	КонецЕсли;
	Если (СтрНайти(ИмяКонструктива, "ПРОЁМ")>0) или (СтрНайти(ИмяКонструктива, "ПРОЕМ")>0) Тогда
		Возврат "Проёмы"; 
	КонецЕсли;
	Если СтрНайти(ИмяКонструктива, "КРЫША")>0 Тогда
		Возврат "Крыша"; 
	КонецЕсли;
	Если СтрНайти(ИмяКонструктива, "БАЛКА")>0 Тогда
		Возврат "Балки"; 
	КонецЕсли;
	Если СтрНайти(ИмяКонструктива, "ЛЕСТНИЦА")>0 Тогда
		Возврат "Лестницы"; 
	КонецЕсли;
	Если СтрНайти(ИмяКонструктива, "ПАНДУС")>0 Тогда
		Возврат "Пандусы"; 
	КонецЕсли;
	Если СтрНайти(ИмяКонструктива, "ДВЕРЬ")>0 Тогда
		Возврат "Двери"; 
	КонецЕсли;
	Если СтрНайти(ИмяКонструктива, "ОКНО")>0 Тогда
		Возврат "Окна"; 
	КонецЕсли;
	Если СтрНайти(ИмяКонструктива, "ОГРАЖДЕНИЕ")>0 Тогда
		Возврат "Ограждения"; 
	КонецЕсли;
	Если СтрНайти(ИмяКонструктива, "ФУНДАМЕНТ")>0 Тогда
		Возврат "Фундаменты"; 
	КонецЕсли;
	Возврат ИмяКонструктива;
	
КОнецФункции

// Ищет тип конструктива по имени. Если не нашла, то создает его.
//
// Параметры:
//     ИмяКонструктива - Строка - имя, переданное из BIM системы.
//
// Возвращаемое значение:
//     СправочникСсылка.СМ_BIM_ТипыКонструктивов - ссылка на найденный элемент.
//
Функция НайтиСоздатьТипКонструктива(Знач ИмяКонструктива) Экспорт
	
	ТипКонструктива = Справочники.СМ_BIM_ТипыКонструктивов.НайтиПоНаименованию(ИмяКонструктива, Ложь);
	Если Не ЗначениеЗаполнено(ТипКонструктива) Тогда
		ТипКонструктиваОб = Справочники.СМ_BIM_ТипыКонструктивов.СоздатьЭлемент();
		ТипКонструктиваОб.Наименование = ИмяКонструктива;
		ТипКонструктиваОб.Записать();
		ТипКонструктива = ТипКонструктиваОб.Ссылка;
	КонецЕсли;      
	
	Возврат ТипКонструктива;
	
КОнецФункции

// Функция ищет конструктив по имени. Если не нашла, то создает его.
//
// Параметры:
//     НаименованиеКонструктива - Строка - имя, переданное из BIM системы.
//     ИдентификаторВМодели - Строка, Число - ID элемента из BIM системы.
//     ТипКонструктива - СправочникСсылка.СМ_BIM_ТипыКонструктивов - текущий тип конструктива.
//     ОбъектСтроительства - СправочникСсылка.СМ_ОбъектСтроительства - ссылка на текущий объект строительства.
//
// Возвращаемое значение:
//     СправочникСсылка.УСОERP_Конструктив - ссылка на найденный элемент.
//
Функция НайтиСоздатьКонструктив(НаименованиеКонструктива, ИдентификаторВМодели, ТипКонструктива, ОбъектСтроительства) Экспорт
	
	ИмяКонструктива = ""+ИдентификаторВМодели;
	Конструктив = Справочники.УСОERP_Конструктив.НайтиПоНаименованию(ИмяКонструктива, Истина, , ОбъектСтроительства);
	Если Не ЗначениеЗаполнено(Конструктив) Тогда
		ТипКонструктиваОб = Справочники.УСОERP_Конструктив.СоздатьЭлемент();
		ТипКонструктиваОб.Наименование = ИмяКонструктива;
		ТипКонструктиваОб.Владелец = ОбъектСтроительства;
		ТипКонструктиваОб.ТипКонструктива = ТипКонструктива;
		ТипКонструктиваОб.НаименованиеПолное = НаименованиеКонструктива;   		
		ТипКонструктиваОб.Записать();
		Конструктив = ТипКонструктиваОб.Ссылка;
	КонецЕсли;      
	
	Возврат Конструктив;
	
КОнецФункции

// Функция ищет объект строительства по данным BIM модели.
//
// Параметры:
//     ПоказательДляРасчета - Строка - идентификатор проекта из BIM системы.
//
// Возвращаемое значение:
//     СправочникСсылка.СМ_ОбъектыСтроительства - ссылка на найденный элемент.
//
Функция ПолучитьОбъектСтроительства(ПоказательДляРасчета) Экспорт
	
	Если ПоказательДляРасчета="" Тогда
		Возврат Справочники.СМ_ОбъектыСтроительства.ПустаяСсылка();
	КонецЕсли;	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СМ_BIM_СоответствиеОбъектов.ОбъектСтроительства
	|ИЗ
	|	РегистрСведений.СМ_BIM_СоответствиеОбъектов КАК СМ_BIM_СоответствиеОбъектов
	|ГДЕ
	|	СМ_BIM_СоответствиеОбъектов.ИдентификаторПроекта = &ИдентификаторПроекта
	|	И СМ_BIM_СоответствиеОбъектов.ИдентификаторВМодели = ""File""
	|;";
	запрос.УстановитьПараметр("ИдентификаторПроекта",ПоказательДляРасчета);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.ОбъектСтроительства;
	КонецЕсли;
	Возврат Справочники.СМ_ОбъектыСтроительства.ПустаяСсылка();
	
КонецФункции

// Функция ищет объект строительства по данным BIM модели с разделами по этажам и типам.
//
// Параметры:
//     ОбъектСтроительства - СправочникСсылка.СМ_ОбъектыСтроительства - ссылка на стройку.
//     ИдентификаторОбъекта - Строка - Идентификатор в системе Ренга.
//     ТаблицаХарактеристик - ТаблицаЗначений - Таблица объемов.
//
// Возвращаемое значение:
//     Строка - описание результата.
//
Функция СоздатьСметныйДокументПоТипамКонструктивов(ОбъектСтроительства, ИдентификаторОбъекта, ТаблицаХарактеристик) Экспорт
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.Значение,
	                    |	ВТ.ЗначениеЧислом,
	                    |	ВТ.ЗначениеСсылка
	                    |ПОМЕСТИТЬ ВТ
	                    |ИЗ
	                    |	&ТЗ КАК ВТ
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.Значение
	                    |ПОМЕСТИТЬ Уровни
	                    |ИЗ
	                    |	ВТ КАК ВТ
	                    |ГДЕ
	                    |	ВТ.ПоказательДляРасчета = ""Level""
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.Значение
	                    |
	                    |ИНДЕКСИРОВАТЬ ПО
	                    |	ИдентификаторВМодели
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.Значение,
	                    |	ВТ.ЗначениеСсылка
	                    |ПОМЕСТИТЬ ТипЭлемента
	                    |ИЗ
	                    |	ВТ КАК ВТ
	                    |ГДЕ
	                    |	ВТ.ПоказательДляРасчета = ""Type""
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.Значение,
	                    |	ВТ.ЗначениеСсылка
	                    |
	                    |ИНДЕКСИРОВАТЬ ПО
	                    |	ИдентификаторВМодели
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.ЗначениеЧислом,
	                    |	ЕСТЬNULL(Уровни.Значение, 1) КАК Уровень,
	                    |	ЕСТЬNULL(ТипЭлемента.ЗначениеСсылка, ""Элементы"") КАК Конструктив,
	                    |	ЕСТЬNULL(ТипЭлемента.Значение, """") КАК НаименованиеКонструктива
	                    |ПОМЕСТИТЬ ВТДоп
	                    |ИЗ
	                    |	ВТ КАК ВТ
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ Уровни КАК Уровни
	                    |		ПО ВТ.ИдентификаторВМодели = Уровни.ИдентификаторВМодели
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ ТипЭлемента КАК ТипЭлемента
	                    |		ПО ВТ.ИдентификаторВМодели = ТипЭлемента.ИдентификаторВМодели
	                    |
	                    |ИНДЕКСИРОВАТЬ ПО
	                    |	ИдентификаторВМодели
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	СУММА(ВТ.ЗначениеЧислом) КАК ЗначениеЧислом,
	                    |	СМ_НормативныеСборники.Ссылка КАК Норматив,
	                    |	ВТ.Уровень КАК Уровень,
	                    |	ВТ.Конструктив КАК Конструктив,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.НаименованиеКонструктива КАК НаименованиеКонструктива
	                    |ИЗ
	                    |	ВТДоп КАК ВТ
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СМ_BIM_СоответствиеОбъектов КАК СМ_BIM_СоответствиеОбъектов
	                    |		ПО ВТ.ИдентификаторВМодели = СМ_BIM_СоответствиеОбъектов.ИдентификаторВМодели
	                    |			И (СМ_BIM_СоответствиеОбъектов.ОбъектСтроительства = &ОбъектСтроительства)
	                    |			И (СМ_BIM_СоответствиеОбъектов.ИдентификаторПроекта = &ИдентификаторПроекта)
	                    |			И ВТ.ПоказательДляРасчета = СМ_BIM_СоответствиеОбъектов.ПоказательДляРасчета
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	                    |		ПО (СМ_BIM_СоответствиеОбъектов.Шифр = СМ_НормативныеСборники.КодНормативнойРасценки)
	                    |			И (СМ_BIM_СоответствиеОбъектов.ТипНормативногоСборника = СМ_НормативныеСборники.ТипНормативногоСборника)
	                    |			И (НЕ СМ_НормативныеСборники.ПометкаУдаления)
	                    |ГДЕ
	                    |	НЕ ВТ.ПоказательДляРасчета В (""Level"", ""Type"", ""Mark"")
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВТ.Уровень,
	                    |	ВТ.Конструктив,
	                    |	СМ_НормативныеСборники.Ссылка,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.НаименованиеКонструктива
	                    |ИТОГИ ПО
	                    |	Уровень КАК Уровень,
	                    |	Конструктив КАК Конструктив,
	                    |	Норматив КАК Норматив");
	
	Запрос.УстановитьПараметр("ОбъектСтроительства",ОбъектСтроительства);
	Запрос.УстановитьПараметр("ИдентификаторПроекта",ИдентификаторОбъекта);
	Запрос.УстановитьПараметр("ТЗ",ТаблицаХарактеристик);
	
	Пакет=Запрос.ВыполнитьПакет();
	
	Попытка
		
		Смета=Документы.СМ_ЛокальнаяСмета.СоздатьДокумент();
		Смета.УстановитьНовыйНомер();
		Смета.Дата = ТекущаяДатаСеанса(); 
		Смета.Стройка = ОбъектСтроительства;
		Смета.Наименование=Формат(ТекущаяДата(),"ДЛФ=DT")+" Данные по модели Renga "+ОбъектСтроительства;
		Смета.Автор = Пользователи.ТекущийПользователь();
		Смета.Статус=Перечисления.СМ_СтатусыСметныхДокументов.Проект;
		СМ_СметаВызовСервера.ЗаполнитьНастройкиПользователяПоУмолчанию(Смета);
		Смета.НомерСметы=1;
		Смета.Валюта = Справочники.Валюты.НайтиПоКоду("643");
		Смета.Записать();
		
		ДанныеУровня=Пакет[4].Выбрать(ОбходрезультатаЗапроса.ПоГруппировкам,"Уровень");	
		НомерПозиции=1;	
		
		Пока ДанныеУровня.Следующий() Цикл
			
			ДанныеКонструктивов=ДанныеУровня.Выбрать(ОбходрезультатаЗапроса.ПоГруппировкам,"Конструктив");
			Раздел							= СМ_СметаВызовСервера.СоздатьНовыйРаздел();
			Раздел.НаименованиеДляПечати 	= "Этаж "+ДанныеУровня.Уровень;
			Раздел.Дата						= ТекущаяДатаСеанса();
			Раздел.ИДРодителя   			= Смета.Ссылка;
			Раздел.ИДСметы      			= Смета.Ссылка;
			Раздел.Расчет					= Истина;
			Раздел.Записать();
			
			Пока ДанныеКонструктивов.Следующий() Цикл
				
				РазделПоЭлементу							= СМ_СметаВызовСервера.СоздатьНовыйРаздел();
				РазделПоЭлементу.НаименованиеДляПечати 	= "" + ДанныеКонструктивов.Конструктив; 
				РазделПоЭлементу.Дата						= ТекущаяДатаСеанса();
				РазделПоЭлементу.ИДРодителя   			= Раздел.Ссылка;
				РазделПоЭлементу.ИДСметы      			= Смета.Ссылка;
				РазделПоЭлементу.Расчет					= Истина;
				РазделПоЭлементу.Записать();
				
				Нормативы=ДанныеКонструктивов.Выбрать(ОбходрезультатаЗапроса.ПоГруппировкам,"Норматив");
				
				Пока Нормативы.Следующий() Цикл
					
					НоваяПозиция = Неопределено;
					
					СтруктураПараметровФормыВыбораВНБ=Неопределено;
					
					ДанныеЦен = Неопределено;
					
					ТЗ_Конструктивы = Новый ТаблицаЗначений();
					ТЗ_Конструктивы.Колонки.Добавить("Конструктив");
					
					ИменаКонструктивов = Нормативы.Выбрать();
				
					Пока ИменаКонструктивов.Следующий() Цикл
						
						КонструктивERP = ТЗ_Конструктивы.Добавить();
						КонструктивERP.Конструктив = НайтиСоздатьКонструктив(СокрЛП(?(ЗначениеЗаполнено(ИменаКонструктивов.НаименованиеКонструктива),
							ИменаКонструктивов.НаименованиеКонструктива,""+ДанныеКонструктивов.Конструктив+" "+ИменаКонструктивов.ИдентификаторВМодели)),						
							ИменаКонструктивов.ИдентификаторВМодели, ДанныеКонструктивов.Конструктив, ОбъектСтроительства);
						   				
					КонецЦикла;
					
					ФактОбъем=ПересчитатьВЕдиницахНорматива(Нормативы.Норматив.ЕдиницаИзмерения,Нормативы.ЗначениеЧислом);
					
					СтруктураПараметровФормыВыбораВНБ = СМ_СметаВызовСервера.СоздатьПозициюЛокальнойСметыПутемПодбораИзНормативногоСборника(Смета.Ссылка,Нормативы.Норматив,РазделПоЭлементу.Ссылка,НомерПозиции, СтруктураПараметровФормыВыбораВНБ, НоваяПозиция, ФактОбъем, ДанныеЦен, ТЗ_Конструктивы);
					
					СМ_СметаВызовСервера.ОбновитьЦены(НоваяПозиция.Ссылка,Смета.Район,Смета.РегионДляВыбораЦен,Истина);
					
					ВставлятьНеучтенные = СМ_СметаВызовСервера.ПолучитьНастройкуНеучтенных("ВставлятьНеучтенныеАвтоматически");	
					Если ВставлятьНеучтенные Тогда
						Если ТипЗнч(СтруктураПараметровФормыВыбораВНБ) = Тип("Структура") Тогда
							ЗаполнитьЦеныНеучтенныхРесурсов(СтруктураПараметровФормыВыбораВНБ.Ресурсы,Смета);
							СМ_СметаВызовСервера.СоздатьПозицииПоНеучтеннымРесурсамИПоПроекту(СтруктураПараметровФормыВыбораВНБ);
							
						КонецЕсли;
					КонецЕсли;
					
					НомерПозиции=НомерПозиции+1;
					
				КонецЦикла;	
			КонецЦикла;	
		КОнецЦикла;
		
		Документы.СМ_ЛокальнаяСмета.Перерасчет(Смета,Ложь,Истина);
		
		Смета.Записать();
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'СМ_BIM WS'",
		ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , "Ошибка создания документа: "+ТекстОшибки);
		
		Возврат "Cannot create doc";
		
	КонецПопытки;
	
	
	Возврат "Ok";	
	
КонецФункции

// Функция ищет объект строительства по данным BIM модели с разделами по меткам модели.
//
// Параметры:
//     ОбъектСтроительства - СправочникСсылка.СМ_ОбъектыСтроительства - ссылка на стройку.
//     ИдентификаторОбъекта - Строка - Идентификатор в системе Ренга.
//     ТаблицаХарактеристик - ТаблицаЗначений - Таблица объемов.
//
// Возвращаемое значение:
//     Строка - описание результата.
//
Функция СоздатьСметныйДокументПоМеткам(ОбъектСтроительства, ИдентификаторОбъекта, ТаблицаХарактеристик) Экспорт
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.Значение,
	                    |	ВТ.ЗначениеЧислом,
	                    |	ВТ.ЗначениеСсылка
	                    |ПОМЕСТИТЬ ВТ
	                    |ИЗ
	                    |	&ТЗ КАК ВТ
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.Значение
	                    |ПОМЕСТИТЬ Уровни
	                    |ИЗ
	                    |	ВТ КАК ВТ
	                    |ГДЕ
	                    |	ВТ.ПоказательДляРасчета = ""Level""
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.Значение
	                    |
	                    |ИНДЕКСИРОВАТЬ ПО
	                    |	ИдентификаторВМодели
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.Значение
	                    |ПОМЕСТИТЬ Метки
	                    |ИЗ
	                    |	ВТ КАК ВТ
	                    |ГДЕ
	                    |	ВТ.ПоказательДляРасчета = ""Mark""
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.Значение
	                    |
	                    |ИНДЕКСИРОВАТЬ ПО
	                    |	ИдентификаторВМодели
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.Значение,
	                    |	ВТ.ЗначениеСсылка
	                    |ПОМЕСТИТЬ ТипЭлемента
	                    |ИЗ
	                    |	ВТ КАК ВТ
	                    |ГДЕ
	                    |	ВТ.ПоказательДляРасчета = ""Type""
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.Значение,
	                    |	ВТ.ЗначениеСсылка
	                    |
	                    |ИНДЕКСИРОВАТЬ ПО
	                    |	ИдентификаторВМодели
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.ЗначениеЧислом,
	                    |	ЕСТЬNULL(Уровни.Значение, 1) КАК Уровень,
	                    |	ЕСТЬNULL(ТипЭлемента.ЗначениеСсылка, ""Элементы"") КАК ТипКонструктив,
	                    |	ЕСТЬNULL(ТипЭлемента.Значение, """") КАК НаименованиеКонструктива,
	                    |	ЕСТЬNULL(Метки.Значение, ЕСТЬNULL(ТипЭлемента.Значение, """")) КАК ОписаниеКонструктива
	                    |ПОМЕСТИТЬ ВТДоп
	                    |ИЗ
	                    |	ВТ КАК ВТ
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ Уровни КАК Уровни
	                    |		ПО ВТ.ИдентификаторВМодели = Уровни.ИдентификаторВМодели
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ ТипЭлемента КАК ТипЭлемента
	                    |		ПО ВТ.ИдентификаторВМодели = ТипЭлемента.ИдентификаторВМодели
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ Метки КАК Метки
	                    |		ПО ВТ.ИдентификаторВМодели = Метки.ИдентификаторВМодели
	                    |
	                    |ИНДЕКСИРОВАТЬ ПО
	                    |	ИдентификаторВМодели
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	СУММА(ВТ.ЗначениеЧислом) КАК ЗначениеЧислом,
	                    |	СМ_НормативныеСборники.Ссылка КАК Норматив,
	                    |	ВТ.Уровень КАК Уровень,
	                    |	ВТ.ТипКонструктив КАК Конструктив,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.НаименованиеКонструктива КАК НаименованиеКонструктива,
	                    |	ВТ.ОписаниеКонструктива КАК ОписаниеКонструктива
	                    |ИЗ
	                    |	ВТДоп КАК ВТ
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СМ_BIM_СоответствиеОбъектов КАК СМ_BIM_СоответствиеОбъектов
	                    |		ПО ВТ.ИдентификаторВМодели = СМ_BIM_СоответствиеОбъектов.ИдентификаторВМодели
	                    |			И (СМ_BIM_СоответствиеОбъектов.ОбъектСтроительства = &ОбъектСтроительства)
	                    |			И (СМ_BIM_СоответствиеОбъектов.ИдентификаторПроекта = &ИдентификаторПроекта)
	                    |			И ВТ.ПоказательДляРасчета = СМ_BIM_СоответствиеОбъектов.ПоказательДляРасчета
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	                    |		ПО (СМ_BIM_СоответствиеОбъектов.Шифр = СМ_НормативныеСборники.КодНормативнойРасценки)
	                    |			И (СМ_BIM_СоответствиеОбъектов.ТипНормативногоСборника = СМ_НормативныеСборники.ТипНормативногоСборника)
	                    |			И (НЕ СМ_НормативныеСборники.ПометкаУдаления)
	                    |ГДЕ
	                    |	НЕ ВТ.ПоказательДляРасчета В (""Level"", ""Type"", ""Mark"")
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВТ.Уровень,
	                    |	ВТ.ТипКонструктив,
	                    |	СМ_НормативныеСборники.Ссылка,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.НаименованиеКонструктива,
	                    |	ВТ.ОписаниеКонструктива
	                    |ИТОГИ ПО
	                    |	Уровень КАК Уровень,
	                    |	ОписаниеКонструктива,
	                    |	Норматив");
	
	Запрос.УстановитьПараметр("ОбъектСтроительства",ОбъектСтроительства);
	Запрос.УстановитьПараметр("ИдентификаторПроекта",ИдентификаторОбъекта);
	Запрос.УстановитьПараметр("ТЗ",ТаблицаХарактеристик);
	
	Пакет=Запрос.ВыполнитьПакет();
	
	Попытка
		
		Смета=Документы.СМ_ЛокальнаяСмета.СоздатьДокумент();
		Смета.УстановитьНовыйНомер();
		Смета.Дата = ТекущаяДатаСеанса(); 
		Смета.Стройка = ОбъектСтроительства;
		Смета.Наименование=Формат(ТекущаяДата(),"ДЛФ=DT")+" Данные по модели Renga "+ОбъектСтроительства;
		Смета.Автор = Пользователи.ТекущийПользователь();
		Смета.Статус=Перечисления.СМ_СтатусыСметныхДокументов.Проект;
		СМ_СметаВызовСервера.ЗаполнитьНастройкиПользователяПоУмолчанию(Смета);
		Смета.НомерСметы=1;
		Смета.Валюта = Справочники.Валюты.НайтиПоКоду("643");
		Смета.Записать();
		
		ДанныеУровня=Пакет[5].Выбрать(ОбходрезультатаЗапроса.ПоГруппировкам,"Уровень");	
		НомерПозиции=1;	
		
		Пока ДанныеУровня.Следующий() Цикл
			
			ДанныеКонструктивов=ДанныеУровня.Выбрать(ОбходрезультатаЗапроса.ПоГруппировкам,"ОписаниеКонструктива");
			Раздел							= СМ_СметаВызовСервера.СоздатьНовыйРаздел();
			Раздел.НаименованиеДляПечати 	= "Этаж "+ДанныеУровня.Уровень;
			Раздел.Дата						= ТекущаяДатаСеанса();
			Раздел.ИДРодителя   			= Смета.Ссылка;
			Раздел.ИДСметы      			= Смета.Ссылка;
			Раздел.Расчет					= Истина;
			Раздел.Записать();
			
			Пока ДанныеКонструктивов.Следующий() Цикл
				
				РазделПоЭлементу							= СМ_СметаВызовСервера.СоздатьНовыйРаздел();
				РазделПоЭлементу.НаименованиеДляПечати 	= "" + ДанныеКонструктивов.ОписаниеКонструктива; 
				РазделПоЭлементу.Дата						= ТекущаяДатаСеанса();
				РазделПоЭлементу.ИДРодителя   			= Раздел.Ссылка;
				РазделПоЭлементу.ИДСметы      			= Смета.Ссылка;
				РазделПоЭлементу.Расчет					= Истина;
				РазделПоЭлементу.Записать();
				
				Нормативы=ДанныеКонструктивов.Выбрать(ОбходрезультатаЗапроса.ПоГруппировкам,"Норматив");
				
				Пока Нормативы.Следующий() Цикл
					
					НоваяПозиция = Неопределено;
					
					СтруктураПараметровФормыВыбораВНБ=Неопределено;
					
					ДанныеЦен = Неопределено;
					
					ТЗ_Конструктивы = Новый ТаблицаЗначений();
					ТЗ_Конструктивы.Колонки.Добавить("Конструктив");
					
					ИменаКонструктивов = Нормативы.Выбрать();
				
					Пока ИменаКонструктивов.Следующий() Цикл
						
						КонструктивERP = ТЗ_Конструктивы.Добавить();
						КонструктивERP.Конструктив = НайтиСоздатьКонструктив(СокрЛП(?(ЗначениеЗаполнено(ИменаКонструктивов.НаименованиеКонструктива),
							ИменаКонструктивов.НаименованиеКонструктива,""+ДанныеКонструктивов.Конструктив+" "+ИменаКонструктивов.ИдентификаторВМодели)),						
							ИменаКонструктивов.ИдентификаторВМодели, ДанныеКонструктивов.Конструктив, ОбъектСтроительства);
						   				
					КонецЦикла;
					
					ФактОбъем=ПересчитатьВЕдиницахНорматива(Нормативы.Норматив.ЕдиницаИзмерения,Нормативы.ЗначениеЧислом);
					
					СтруктураПараметровФормыВыбораВНБ = СМ_СметаВызовСервера.СоздатьПозициюЛокальнойСметыПутемПодбораИзНормативногоСборника(Смета.Ссылка,Нормативы.Норматив,РазделПоЭлементу.Ссылка,НомерПозиции, СтруктураПараметровФормыВыбораВНБ, НоваяПозиция, ФактОбъем, ДанныеЦен, ТЗ_Конструктивы);
					
					СМ_СметаВызовСервера.ОбновитьЦены(НоваяПозиция.Ссылка,Смета.Район,Смета.РегионДляВыбораЦен,Истина);
					
					ВставлятьНеучтенные = СМ_СметаВызовСервера.ПолучитьНастройкуНеучтенных("ВставлятьНеучтенныеАвтоматически");	
					Если ВставлятьНеучтенные Тогда
						Если ТипЗнч(СтруктураПараметровФормыВыбораВНБ) = Тип("Структура") Тогда
							
							ЗаполнитьЦеныНеучтенныхРесурсов(СтруктураПараметровФормыВыбораВНБ.Ресурсы,Смета);
							СМ_СметаВызовСервера.СоздатьПозицииПоНеучтеннымРесурсамИПоПроекту(СтруктураПараметровФормыВыбораВНБ);
							
						КонецЕсли;
					КонецЕсли;
					
					НомерПозиции=НомерПозиции+1;
					
				КонецЦикла;	
			КонецЦикла;	
		КОнецЦикла;
		
		Документы.СМ_ЛокальнаяСмета.Перерасчет(Смета,Ложь,Истина);
		
		Смета.Записать();
		
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'СМ_BIM WS'",
		ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , "Ошибка создания документа: "+ТекстОшибки);
		
		Возврат "Cannot create doc";
	КонецПопытки;
	
	
	Возврат "Ok";	   
КонецФункции

// Функция ищет объект строительства по данным BIM модели по разделам для каждого конструктива.
//
// Параметры:
//     ОбъектСтроительства - СправочникСсылка.СМ_ОбъектыСтроительства - ссылка на стройку.
//     ИдентификаторОбъекта - Строка - Идентификатор в системе Ренга.
//     ТаблицаХарактеристик - ТаблицаЗначений - Таблица объемов.
//
// Возвращаемое значение:
//     Строка - описание результата.
//
Функция СоздатьСметныйДокументПоКонструктивам(ОбъектСтроительства, ИдентификаторОбъекта, ТаблицаХарактеристик) Экспорт
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.Значение,
	                    |	ВТ.ЗначениеЧислом,
	                    |	ВТ.ЗначениеСсылка
	                    |ПОМЕСТИТЬ ВТ
	                    |ИЗ
	                    |	&ТЗ КАК ВТ
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.Значение
	                    |ПОМЕСТИТЬ Уровни
	                    |ИЗ
	                    |	ВТ КАК ВТ
	                    |ГДЕ
	                    |	ВТ.ПоказательДляРасчета = ""Level""
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.Значение
	                    |
	                    |ИНДЕКСИРОВАТЬ ПО
	                    |	ИдентификаторВМодели
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.Значение,
	                    |	ВТ.ЗначениеСсылка
	                    |ПОМЕСТИТЬ ТипЭлемента
	                    |ИЗ
	                    |	ВТ КАК ВТ
	                    |ГДЕ
	                    |	ВТ.ПоказательДляРасчета = ""Type""
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.Значение,
	                    |	ВТ.ЗначениеСсылка
	                    |
	                    |ИНДЕКСИРОВАТЬ ПО
	                    |	ИдентификаторВМодели
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВТ.ПоказательДляРасчета,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.ЗначениеЧислом,
	                    |	ЕСТЬNULL(Уровни.Значение, 1) КАК Уровень,
	                    |	ЕСТЬNULL(ТипЭлемента.ЗначениеСсылка, ""Элементы"") КАК Конструктив,
	                    |	ЕСТЬNULL(ТипЭлемента.Значение, """") КАК НаименованиеКонструктива
	                    |ПОМЕСТИТЬ ВТДоп
	                    |ИЗ
	                    |	ВТ КАК ВТ
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ Уровни КАК Уровни
	                    |		ПО ВТ.ИдентификаторВМодели = Уровни.ИдентификаторВМодели
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ ТипЭлемента КАК ТипЭлемента
	                    |		ПО ВТ.ИдентификаторВМодели = ТипЭлемента.ИдентификаторВМодели
	                    |
	                    |ИНДЕКСИРОВАТЬ ПО
	                    |	ИдентификаторВМодели
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	СУММА(ВТ.ЗначениеЧислом) КАК ЗначениеЧислом,
	                    |	СМ_НормативныеСборники.Ссылка КАК Норматив,
	                    |	ВТ.Уровень КАК Уровень,
	                    |	ВТ.Конструктив КАК Конструктив,
	                    |	ВТ.ИдентификаторВМодели КАК ИдентификаторВМодели,
	                    |	ВТ.НаименованиеКонструктива КАК НаименованиеКонструктива
	                    |ИЗ
	                    |	ВТДоп КАК ВТ
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СМ_BIM_СоответствиеОбъектов КАК СМ_BIM_СоответствиеОбъектов
	                    |		ПО ВТ.ИдентификаторВМодели = СМ_BIM_СоответствиеОбъектов.ИдентификаторВМодели
	                    |			И (СМ_BIM_СоответствиеОбъектов.ОбъектСтроительства = &ОбъектСтроительства)
	                    |			И (СМ_BIM_СоответствиеОбъектов.ИдентификаторПроекта = &ИдентификаторПроекта)
	                    |			И ВТ.ПоказательДляРасчета = СМ_BIM_СоответствиеОбъектов.ПоказательДляРасчета
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	                    |		ПО (СМ_BIM_СоответствиеОбъектов.Шифр = СМ_НормативныеСборники.КодНормативнойРасценки)
	                    |			И (СМ_BIM_СоответствиеОбъектов.ТипНормативногоСборника = СМ_НормативныеСборники.ТипНормативногоСборника)
	                    |			И (НЕ СМ_НормативныеСборники.ПометкаУдаления)
	                    |ГДЕ
	                    |	НЕ ВТ.ПоказательДляРасчета В (""Level"", ""Type"", ""Mark"")
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВТ.Уровень,
	                    |	ВТ.Конструктив,
	                    |	СМ_НормативныеСборники.Ссылка,
	                    |	ВТ.ИдентификаторВМодели,
	                    |	ВТ.НаименованиеКонструктива
	                    |ИТОГИ ПО
	                    |	Уровень КАК Уровень,
	                    |	Конструктив КАК Конструктив,
	                    |	НаименованиеКонструктива,
	                    |	ИдентификаторВМодели,
	                    |	Норматив КАК Норматив");
	
	Запрос.УстановитьПараметр("ОбъектСтроительства",ОбъектСтроительства);
	Запрос.УстановитьПараметр("ИдентификаторПроекта",ИдентификаторОбъекта);
	Запрос.УстановитьПараметр("ТЗ",ТаблицаХарактеристик);
	
	Пакет=Запрос.ВыполнитьПакет();
	
	Попытка
		
		Смета=Документы.СМ_ЛокальнаяСмета.СоздатьДокумент();
		Смета.УстановитьНовыйНомер();
		Смета.Дата = ТекущаяДатаСеанса(); 
		Смета.Стройка = ОбъектСтроительства;
		Смета.Наименование=Формат(ТекущаяДата(),"ДЛФ=DT")+" Данные по модели Renga "+ОбъектСтроительства;
		Смета.Автор = Пользователи.ТекущийПользователь();
		Смета.Статус=Перечисления.СМ_СтатусыСметныхДокументов.Проект;
		СМ_СметаВызовСервера.ЗаполнитьНастройкиПользователяПоУмолчанию(Смета);
		Смета.НомерСметы=1;
		Смета.Валюта = Справочники.Валюты.НайтиПоКоду("643");
		Смета.Записать();
		
		ДанныеУровня=Пакет[4].Выбрать(ОбходрезультатаЗапроса.ПоГруппировкам,"Уровень");	
		НомерПозиции=1;	
		
		Пока ДанныеУровня.Следующий() Цикл
			
			ДанныеКонструктивов=ДанныеУровня.Выбрать(ОбходрезультатаЗапроса.ПоГруппировкам,"Конструктив");
			Раздел							= СМ_СметаВызовСервера.СоздатьНовыйРаздел();
			Раздел.НаименованиеДляПечати 	= "Этаж "+ДанныеУровня.Уровень;
			Раздел.Дата						= ТекущаяДатаСеанса();
			Раздел.ИДРодителя   			= Смета.Ссылка;
			Раздел.ИДСметы      			= Смета.Ссылка;
			Раздел.Расчет					= Истина;
			Раздел.Записать();
			
			Пока ДанныеКонструктивов.Следующий() Цикл
				
				ДанныеНаименованийКонструктивов=ДанныеКонструктивов.Выбрать(ОбходрезультатаЗапроса.ПоГруппировкам,"НаименованиеКонструктива");
				Раздел							= СМ_СметаВызовСервера.СоздатьНовыйРаздел();
				Раздел.НаименованиеДляПечати 	= "" + ДанныеКонструктивов.Конструктив;
				Раздел.Дата						= ТекущаяДатаСеанса();
				Раздел.ИДРодителя   			= Смета.Ссылка;
				Раздел.ИДСметы      			= Смета.Ссылка;
				Раздел.Расчет					= Истина;
				Раздел.Записать();
				
				Пока ДанныеНаименованийКонструктивов.Следующий() Цикл

					ДанныеЭлементов=ДанныеНаименованийКонструктивов.Выбрать(ОбходрезультатаЗапроса.ПоГруппировкам,"ИдентификаторВМодели");
					
					Пока ДанныеЭлементов.Следующий() Цикл

						РазделПоЭлементу							= СМ_СметаВызовСервера.СоздатьНовыйРаздел();
						РазделПоЭлементу.НаименованиеДляПечати 	= "" + ДанныеЭлементов.НаименованиеКонструктива + " (" + ДанныеЭлементов.ИдентификаторВМодели + ")"; 
						РазделПоЭлементу.Дата						= ТекущаяДатаСеанса();
						РазделПоЭлементу.ИДРодителя   			= Раздел.Ссылка;
						РазделПоЭлементу.ИДСметы      			= Смета.Ссылка;
						РазделПоЭлементу.Расчет					= Истина;
						РазделПоЭлементу.Записать();
						
						Нормативы=ДанныеЭлементов.Выбрать(ОбходрезультатаЗапроса.ПоГруппировкам,"Норматив");
						
						Пока Нормативы.Следующий() Цикл
							
							НоваяПозиция = Неопределено;
							
							СтруктураПараметровФормыВыбораВНБ=Неопределено;
							
							ДанныеЦен = Неопределено;
							
							ТЗ_Конструктивы = Новый ТаблицаЗначений();
							ТЗ_Конструктивы.Колонки.Добавить("Конструктив");
							
							ИменаКонструктивов = Нормативы.Выбрать();
						
							Пока ИменаКонструктивов.Следующий() Цикл
								
								КонструктивERP = ТЗ_Конструктивы.Добавить();
								КонструктивERP.Конструктив = НайтиСоздатьКонструктив(СокрЛП(?(ЗначениеЗаполнено(ИменаКонструктивов.НаименованиеКонструктива),
									ИменаКонструктивов.НаименованиеКонструктива,""+ДанныеКонструктивов.Конструктив+" "+ИменаКонструктивов.ИдентификаторВМодели)),						
									ИменаКонструктивов.ИдентификаторВМодели, ДанныеКонструктивов.Конструктив, ОбъектСтроительства);
								   				
							КонецЦикла;
							
							ФактОбъем=ПересчитатьВЕдиницахНорматива(Нормативы.Норматив.ЕдиницаИзмерения,Нормативы.ЗначениеЧислом);
							
							СтруктураПараметровФормыВыбораВНБ = СМ_СметаВызовСервера.СоздатьПозициюЛокальнойСметыПутемПодбораИзНормативногоСборника(Смета.Ссылка,Нормативы.Норматив,РазделПоЭлементу.Ссылка,НомерПозиции, СтруктураПараметровФормыВыбораВНБ, НоваяПозиция, ФактОбъем, ДанныеЦен, ТЗ_Конструктивы);
							
							СМ_СметаВызовСервера.ОбновитьЦены(НоваяПозиция.Ссылка,Смета.Район,Смета.РегионДляВыбораЦен,Истина);
							
							ВставлятьНеучтенные = СМ_СметаВызовСервера.ПолучитьНастройкуНеучтенных("ВставлятьНеучтенныеАвтоматически");	
							Если ВставлятьНеучтенные Тогда
								//Если ТипЗнч(СтруктураПараметровФормыВыбораВНБ) = Тип("Структура") Тогда
								//	ЗаполнитьЦеныНеучтенныхРесурсов(СтруктураПараметровФормыВыбораВНБ.Ресурсы,Смета);
								//	СМ_СметаВызовСервера.СоздатьПозицииПоНеучтеннымРесурсамИПоПроекту(СтруктураПараметровФормыВыбораВНБ);
								//	
								//КонецЕсли;
							КонецЕсли;
							
							НомерПозиции=НомерПозиции+1;
							
						КонецЦикла;	
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;	
		КОнецЦикла;
		
		Документы.СМ_ЛокальнаяСмета.Перерасчет(Смета,Ложь,Истина);
		
		Смета.Записать();
		
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'СМ_BIM WS'",
		ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , "Ошибка создания документа: "+ТекстОшибки);
		
		Возврат "Cannot create doc";
	КонецПопытки;
	
	
	Возврат "Ok";	   
КонецФункции

// Функция для наименования типа нормативного сборника модели из файла
// определяет соответствие в справочнике нормативных сборников.
//
// Параметры:
//     ТипНормативногоСборникаИсх - Строка - содержит строку нормативного сборника.
//
// Возвращаемое значение:
//     ПеречислениеСсылка.СМ_ТипыНормативныхСборников - тип нормативного сборника.
//
Функция ПреобразоватьТипНормативногоСборника(Знач ТипНормативногоСборникаИсх) Экспорт
	
	ИмяСборника = ВРег(ТипНормативногоСборникаИсх);
	
	// ГЭСН (строительство)
	Если СтрНайти(ИмяСборника, "СТРОИТЕЛЬСТВО") > 0 Тогда
		Возврат Перечисления.СМ_ТипыНормативныхСборников.СтроительныеРаботы;
	КонецЕсли;
	
	// ГЭСНр (ремонт)
	Если СтрНайти(ИмяСборника, "РЕМОНТ") > 0 Тогда
		Возврат Перечисления.СМ_ТипыНормативныхСборников.РемонтноСтроительныеРаботы;
	КонецЕсли;
	
	// ГЭСНм (монтаж)
	Если СтрНайти(ИмяСборника, "МОНТАЖ") > 0 Тогда
		Возврат Перечисления.СМ_ТипыНормативныхСборников.МонтажныеРаботы;
	КонецЕсли;
	
	// ГЭСНп (пусконаладка)
	Если СтрНайти(ИмяСборника, "ПУСКОНАЛАДКА") > 0 Тогда
		Возврат Перечисления.СМ_ТипыНормативныхСборников.ПусконаладочныеРаботы;
 	КонецЕсли;	
	
	// ГЭСНп (ремонт оборудования)
	Если СтрНайти(ИмяСборника, "РЕМОНТ") > 0 Тогда
		Возврат Перечисления.СМ_ТипыНормативныхСборников.РемонтноСтроительныеРаботы;
	КонецЕсли;	
	
	Возврат Перечисления.СМ_ТипыНормативныхСборников.СтроительныеРаботы;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункцииИПроцедуры

Процедура ЗаполнитьЦеныНеучтенныхРесурсов(АдресТаблицыРесурсов,Объект)
	
	ТаблицаРесурсов = ПолучитьИзВременногоХранилища(АдресТаблицыРесурсов);
	СтруктураПараметровЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(Объект.Ссылка);
	Район = СтруктураПараметровЛС.Район;
	ДатаТекущихЦен = СтруктураПараметровЛС.ДатаТекущихЦен;
	РегиональнаяБаза = СтруктураПараметровЛС.РегионДляВыбораЦен;
	ТаблицаРесурсов.Колонки.Добавить("ФлПрайс");
	ТаблицаРесурсов.Колонки.Добавить("НеИндексировать");
	ТаблицаРесурсов.Колонки.Добавить("ФлагОборудование");
	Для Каждого стр Из ТаблицаРесурсов Цикл
		СтруктураЦен = Новый Структура();
		СтруктураЦен.Вставить("БазиснаяЦена");
		СтруктураЦен.Вставить("БазиснаяЗарплатаМашинистов");
		СтруктураЦен.Вставить("ТекущаяЦена");
		СтруктураЦен.Вставить("ТекущаяЗарплатаМашинистов");
		СМ_СметаВызовСервера.ПолучитьЦеныНовогоРесурса(стр.Ресурс,Район,РегиональнаяБаза,ДатаТекущихЦен,СтруктураЦен,Истина);
		Если ЗначениеЗаполнено(СтруктураЦен.ТекущаяЦена) Тогда
			стр.ТекущаяЦена = СтруктураЦен.ТекущаяЦена;
		КонецЕсли;
		стр.ФлПрайс=Ложь;
		стр.НеИндексировать=Ложь;
		стр.ФлагОборудование = Ложь;
	КонецЦикла;
	ПоместитьВоВременноеХранилище(ТаблицаРесурсов, АдресТаблицыРесурсов);
	
КонецПроцедуры

Функция ПересчитатьВЕдиницахНорматива(ЕдиницаИзмерения,ТекОбъем) 
	
	КоэффициентПеревода = ЕдиницаИзмерения.КоэффициентПеревода;
	НовыйОбъем = ТекОбъем / ?(КоэффициентПеревода = 0, 1, КоэффициентПеревода);
	
	Возврат НовыйОбъем;
	
КонецФункции

#КонецОбласти
